In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df1 = pd.read_csv("./clean_data/Arrests_2020_cleaned.csv")
df2 = pd.read_csv("./clean_data/Arrests_2021_cleaned.csv")
df3 = pd.read_csv("./clean_data/neighborhood_cleaned.csv")
df3.set_index('NAME', inplace=True)

In [3]:
arrests_df = pd.concat([df1, df2])
arrests_df

              NHA_NAME  sex age  day  month  year  fel_misd
0         Dodge Flower    1  21    4      0  2020         2
1         Dodge Flower    1  21    4      0  2020         2
2      West University    1  24    5      0  2020         2
3      West University    1  24    5      0  2020         2
4         Dodge Flower    1  21    4      0  2020         2
...                ...  ...  ..  ...    ...   ...       ...
32081            Amphi    0  49    2      1  2021         2
32082    Flowing Wells    1  22    4      2  2021         2
32083    Flowing Wells    1  22    4      2  2021         2
32084    Flowing Wells    1  22    4      2  2021         5
32085         Downtown    1  30    1      1  2021         1

[69395 rows x 7 columns]

In [4]:
arrests_df['MEDHINC_CY'] = arrests_df['NHA_NAME'].map(df3['MEDHINC_CY'])
arrests_df['WLTHINDXCY'] = arrests_df['NHA_NAME'].map(df3['WLTHINDXCY'])
arrests_df

,NHA_NAME,sex,age,day,month,year,fel_misd,MEDHINC_CY,WLTHINDXCY
0,Dodge Flower,1,21,4,0,2020,2,25336.0,27.0
1,Dodge Flower,1,21,4,0,2020,2,25336.0,27.0
2,West University,1,24,5,0,2020,2,25427.0,30.0
3,West University,1,24,5,0,2020,2,25427.0,30.0
4,Dodge Flower,1,21,4,0,2020,2,25336.0,27.0
...,...,...,...,...,...,...,...,...,...
32081,Amphi,0,49,2,1,2021,2,20213.0,20.0
32082,Flowing Wells,1,22,4,2,2021,2,30668.0,35.0
32083,Flowing Wells,1,22,4,2,2021,2,30668.0,35.0
32084,Flowing Wells,1,22,4,2,2021,5,30668.0,35.0
32085,Downtown,1,30,1,1,2021,1,36471.0,26.0

In [5]:
arrests_df = arrests_df.drop(columns="year")
arrests_df = arrests_df[["NHA_NAME","sex","age","day","month","MEDHINC_CY","WLTHINDXCY","fel_misd"]]
arrests_df = arrests_df.drop(columns="NHA_NAME")
arrests_df.to_csv('./clean_data/fully_merged_data.csv', index=False)